{
  "titulo_juego": "NEURORESCUE: DESAFÍO AUTÓNOMO",
  "nivel_1": {
    "contexto": "Es tu primer día como residente en el Hospital General. La recepción coordina los ingresos y la Dra. Jessica revisa los casos.",
    "casos": {
      "1": {
        "sistema": "Ojos",
        "preguntas": {
          "introduccion": "Buenos días, . Tenemos nuestro primer caso. Un joven de 22 años llega a urgencias tras un leve accidente de bicicleta. No tiene fracturas, pero se muy agitado y se queja de que ve borroso de cerca. Al examinarlo, noto que sus pupilas están notablemente dilatadas (midriasis). Esto seguramente es una respuesta adrenérgica por el susto del accidente. ¿Podría decirme qué receptor se implicado principalmente en este efecto?",
          "1": "Activación de receptores M3 en el músculo esfínter del iris",
          "2": "Activación de receptores β2 en el músculo ciliar",
          "3": "Activación de receptores α1 en el músculo radial del iris",
          "4": "Bloqueo de receptores M2 en el músculo ciliar",
          "correcta": 3
        },
        "sintomas": [
          "👁️ Midriasis (pupilas dilatadas)",
          "👁️ Visión borrosa de cerca",
          "😰 Agitación (activación simpática)"
        ],
        "retroalimentacion": {
          "acierto": "¡Exacto! El músculo radial del iris (dilatador) se contrae con la noradrenalina actuando sobre receptores α1, provocando la midriasis. La visión borrosa de cerca se debe a que el músculo ciliar también está relajado. Buen ojo, doctor/a.",
          "fallo": "Casi. Recordemos: la midriasis es una respuesta simpática. Los receptores M3 parasimpáticos causan miosis, no midriasis. El receptor correcto es α1 en el músculo radial."
        },
        "recompensa": {
          "PK": 10,
          "logro": "Primeros Pasos en Oftalmología"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Ojos. Paciente listo para valoración. Resumen: Buenos días, doctor/a. Tenemos nuestro primer caso. Un joven de 22 años llega a urgencias tras un leve accidente de bicicleta. No tiene fracturas, pero está muy agitado y se queja de que ve borroso de cerca. Al examinarlo, noto que sus pupilas están notablemente dilatadas (midriasis). Esto seguramente es una respuesta adrenérgica por el susto del accidente.",
          "doctora": "¿Podría decirme qué receptor está implicado principalmente en este efecto?"
        }
      },
      "2": {
        "sistema": "Cardiovascular (Corazón)",
        "preguntas": {
          "introduccion": "Muy bien. Ahora tenemos a una paciente de 30 años que acaba de sufrir una crisis de ansiedad. Sus signos vitales muestran taquicardia (FC: 120 lpm) y presión arterial elevada. Esto es clásico de una descarga simpática. ¿Qué receptor cardiaco es el principal responsable de aumentar la frecuencia cardíaca?",
          "1": "Bloqueo de receptores β1 en el nodo sinusal",
          "2": "Activación de receptores β1 en el nodo sinusal",
          "3": "Activación de receptores M2 en el nodo auriculoventricular",
          "4": "Activación de receptores α1 en las arterias coronarias",
          "correcta": 2
        },
        "sintomas": [
          "💓 Taquicardia (FC: 120 lpm)",
          "📈 Presión arterial elevada",
          "😥 Crisis de ansiedad (activación simpática)"
        ],
        "retroalimentacion": {
          "acierto": "¡Correcto! Los receptores β1 en el nodo sinusal (SA) son los encargados de aumentar la frecuencia cardíaca (cronotropía) durante la respuesta de lucha o huida. Está aprendiendo rápido.",
          "fallo": "Vamos a repasar. Los receptores M2 son parasimpáticos y enlentecen el corazón. Los α1 no son los principales en el corazón para la frecuencia. La respuesta es β1 en el nodo sinusal."
        },
        "recompensa": {
          "PK": 10,
          "powerup": "Farmacología Express (1 uso gratis)"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Cardiovascular (Corazón). Paciente listo para valoración. Resumen: Muy bien. Ahora tenemos a una paciente de 30 años que acaba de sufrir una crisis de ansiedad. Sus signos vitales muestran taquicardia (FC: 120 lpm) y presión arterial elevada. Esto es clásico de una descarga simpática.",
          "doctora": "¿Qué receptor cardiaco es el principal responsable de aumentar la frecuencia cardíaca?"
        }
      },
      "3": {
        "sistema": "Glándulas exocrinas",
        "preguntas": {
          "introduccion": "Último caso de la jornada. Un hombre de 50 años viene por un control. Está tomando un nuevo medicamento para los espasmos intestinales y menciona como efecto secundario que siente la boca extremadamente seca (xerostomía). ¿Qué tipo de receptor crees que se bloqueando su medicación para causar este efecto?",
          "1": "Bloqueo de receptores α1 en las glándulas salivales",
          "2": "Activación de receptores β2 en los acinos pancreáticos",
          "3": "Bloqueo de receptores M3 en las glándulas salivales",
          "4": "Activación de receptores α2 en las terminaciones nerviosas",
          "correcta": 3
        },
        "sintomas": [
          "👄 Boca seca (xerostomía)",
          "💊 Efecto secundario de medicamento anticolinérgico"
        ],
        "retroalimentacion": {
          "acierto": "¡Así es! Los receptores muscarínicos M3 son los responsables de estimular la secreción de saliva. Si un fármaco los bloquea (efecto anticolinérgico), causa sequedad de boca. Diagnóstico perfecto.",
          "fallo": "Casi. Las glándulas salivales están principalmente controladas por el sistema parasimpático a través de receptores M3. La sequedad es por bloqueo de estos receptores, no por activación de otros."
        },
        "recompensa": {
          "PK": 15,
          "logro": "Diagnóstico en Seco",
          "powerup_permanente": "Rayos X del SNA (elimina 2 respuestas incorrectas por 5 PK)"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Glándulas exocrinas. Paciente listo para valoración. Resumen: Último caso de la jornada. Un hombre de 50 años viene por un control. Está tomando un nuevo medicamento para los espasmos intestinales y menciona como efecto secundario que siente la boca extremadamente seca (xerostomía).",
          "doctora": "¿Qué tipo de receptor crees que está bloqueando su medicación para causar este efecto?"
        }
      }
    },
    "resumen": {
      "PK_total_nivel": 35,
      "powerups": [
        "Farmacología Express (1 uso)",
        "Rayos X del SNA (disponible)"
      ],
      "logros": "2/50",
      "proximo_nivel": "Nivel 2 (Moderado)"
    }
  },
  "nivel_2": {
    "contexto": "La recepción reporta casos de mayor complejidad y la Dra. Jessica supervisa. Ahora te enviará pacientes con síntomas más sutiles o que involucran más de un sistema. ¡Veamos cómo te va!",
    "casos": {
      "4": {
        "sistema": "Cardiovascular y Renal",
        "preguntas": {
          "introduccion": "necesito su ayuda con un caso interesante. Tenemos a un paciente hipertenso de 60 años que se siendo tratado con un nuevo bloqueante adrenérgico. Desde que empezó el tratamiento, reporta mareos al ponerse de pie (hipotensión ortostática) y su frecuencia cardíaca en reposo es de 55 lpm (ligera bradicardia). El fármaco que toma es de acción predominantemente periférica. ¿Qué receptor creemos que se bloqueando?",
          "1": "Bloqueo de receptores β2 en el músculo esquelético",
          "2": "Bloqueo de receptores α1 en vasos sanguíneos",
          "3": "Bloqueo de receptores M3 en el corazón",
          "4": "Bloqueo de receptores β1 en el riñón",
          "correcta": 2
        },
        "sintomas": [
          "💫 Hipotensión ortostática (mareos al ponerse de pie)",
          "💓 Bradicardia leve (FC: 55 lpm)",
          "💊 Tratamiento con bloqueante adrenérgico"
        ],
        "retroalimentacion": {
          "acierto": "¡Brillante! Efectivamente, el bloqueo de los receptores α1 vasculares impide la vasoconstricción, causando hipotensión ortostática. La bradicardia puede ser un efecto secundario o reflejo. Estás pensando como un experto.",
          "fallo": "Pensémoslo de nuevo. Los mareos al ponerse de pie apuntan a un problema vascular, no cardiaco puro. El bloqueo de β2 o M3 no causa esto de manera primaria. La clave es el bloqueo α1 en los vasos."
        },
        "recompensa": {
          "PK": 15
        },
        "dialogo": {
          "recepcionista": "Ingreso en Cardiovascular y Renal. Paciente listo para valoración. Resumen: Doctor/a, necesito su ayuda con un caso interesante. Tenemos a un paciente hipertenso de 60 años que está siendo tratado con un nuevo bloqueante adrenérgico. Desde que empezó el tratamiento, reporta mareos al ponerse de pie (hipotensión ortostática) y su frecuencia cardíaca en reposo es de 55 lpm (ligera bradicardia). El fármaco que toma es de acción predominantemente periférica.",
          "doctora": "¿Qué receptor creemos que está bloqueando?"
        }
      },
      "5": {
        "sistema": "Pulmonar y Muscular",
        "preguntas": {
          "introduccion": "Tenemos una emergencia en la sala de espera. Un adolescente con asma conocida olvidó su inhalador y se teniendo una crisis. Presenta disnea severa (dificultad para respirar), sibilancias audibles y se usando los músculos accesorios para respirar. Para aliviarlo rápidamente, necesitamos relajar su músculo liso bronquial. ¿Qué receptor debemos activar de forma prioritaria?",
          "1": "Activación de receptores α1 en los bronquios",
          "2": "Activación de receptores β2 en el músculo liso bronquial",
          "3": "Activación de receptores M3 en las glándulas bronquiales",
          "4": "Bloqueo de receptores M2 en los terminales nerviosos",
          "correcta": 2
        },
        "sintomas": [
          "😮‍💨 Disnea severa",
          "🔊 Sibilancias (broncoconstricción)",
          "🏃‍♂️ Historia de asma"
        ],
        "retroalimentacion": {
          "acierto": "¡Excelente! Activando los receptores β2 conseguimos una broncodilatación rápida y salvamos la vida a este chico. Es justo el mecanismo de su inhalador de rescate. Decisiones precisas bajo presión.",
          "fallo": "Casi. Activar α1 o M3 empeoraría la contracción del músculo liso. La respuesta de emergencia es la activación de los receptores β2 para lograr la broncodilatación."
        },
        "recompensa": {
          "PK": 15,
          "powerup": "Tutor Virtual (1 uso gratis)"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Pulmonar y Muscular. Paciente listo para valoración. Resumen: Tenemos una emergencia en la sala de espera. Un adolescente con asma conocida olvidó su inhalador y está teniendo una crisis. Presenta disnea severa (dificultad para respirar), sibilancias audibles y está usando los músculos accesorios para respirar. Para aliviarlo rápidamente, necesitamos relajar su músculo liso bronquial.",
          "doctora": "¿Qué receptor debemos activar de forma prioritaria?"
        }
      },
      "6": {
        "sistema": "Gastrointestinal y Glandular (Jefe de nivel)",
        "preguntas": {
          "introduccion": "este es el caso más desafiante del turno. Un paciente fue encontrado confundido en un invernadero. Presenta vómitos, dolor abdominal cólico, diarrea profusa, lagrimeo constante y salivación excesiva (sialorrea). Sus pupilas están puntiformes (miosis intensa). Todo apunta a una intoxicación. ¿Cuál es el mecanismo fisiopatológico subyacente?",
          "1": "Bloqueo masivo de receptores adrenérgicos α y β",
          "2": "Activación masiva de receptores colinérgicos muscarínicos M2 y M3",
          "3": "Bloqueo masivo de receptores colinérgicos nicotínicos",
          "4": "Activación masiva de receptores adrenérgicos β2",
          "correcta": 2
        },
        "sintomas": [
          "🤢 Vómitos, dolor abdominal, diarrea",
          "😭 Lagrimeo",
          "👄 Salivación excesiva (sialorrea)",
          "👁️ Miosis intensa",
          "🧠 Confusión"
        ],
        "retroalimentacion": {
          "acierto": "¡Diagnóstico espectacular! Ha identificado correctamente una intoxicación colinérgica por activación masiva de receptores muscarínicos. La atropina (antagonista muscarínico) es el antídoto. Estás listo/a para lo que sea.",
          "fallo": "Es un caso complejo. Revisemos los síntomas: secreciones excesivas y miosis son signos parasimpaticomiméticos, no de bloqueo ni de activación adrenérgica. La clave es la activación masiva de los receptores M3 y M2."
        },
        "recompensa": {
          "PK": 25,
          "logro": "Toxicólogo en Formación",
          "powerup_permanente": "Tutor Virtual con descuento (12 PK)"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Gastrointestinal y Glandular (Jefe de nivel). Paciente listo para valoración. Resumen: Doctor/a, este es el caso más desafiante del turno. Un paciente fue encontrado confundido en un invernadero. Presenta vómitos, dolor abdominal cólico, diarrea profusa, lagrimeo constante y salivación excesiva (sialorrea). Sus pupilas están puntiformes (miosis intensa). Todo apunta a una intoxicación.",
          "doctora": "¿Cuál es el mecanismo fisiopatológico subyacente?"
        }
      }
    },
    "resumen": {
      "PK_total_nivel": 55,
      "powerups": [
        "Farmacología Express (1)",
        "Rayos X del SNA",
        "Tutor Virtual (1 uso gratis)"
      ],
      "logros": "3/50",
      "proximo_nivel": "Nivel 3 (Difícil)"
    }
  },
  "nivel_3": {
    "contexto": "La recepción y la Dra. Jessica presentan casos complejos con síntomas solapados y decisiones con consecuencias.",
    "casos": {
      "7": {
        "sistema": "Cardiovascular + Metabólico",
        "preguntas": {
          "introduccion": "¡Boom! Primer caso del turno. Deportista de 25 años. Llega tras una competición. Está ansioso, con taquicardia (110 lpm), y en su analítica destaca una glucosa en sangre de 250 mg/dL (hiperglucemia) a pesar de no ser diabético. Su sudoración es profusa. ¿Qué dos receptores están trabajando horas extras para causar este combo de síntomas?",
          "1": "Activación de α1 (vasos) y β3 (grasa)",
          "2": "Activación de β1 (corazón) y α1/β2 (hígado)",
          "3": "Activación de M3 (glándulas) y M2 (corazón)",
          "4": "Bloqueo de α2 (páncreas) y β1 (corazón)",
          "correcta": 2
        },
        "sintomas": [
          "💓 Taquicardia (110 lpm)",
          "📊 Hiperglucemia (250 mg/dL)",
          "💦 Sudoración profusa",
          "😰 Ansiedad (activación simpática)"
        ],
        "retroalimentacion": {
          "acierto": "¡Le diste al clavo! β1 para el motor cardiaco y el combo α1/β2 para liberar glucosa a la sangre y dar energía. Es la respuesta de 'lucha o huida' en estado puro. ¡Sigue así!",
          "fallo": "Casi, pero no. La sudoración es adrenérgica (α1), no colinérgica (M3). Y la hiperglucemia viene del hígado (α1/β2), no de la grasa (β3). La respuesta es B."
        },
        "recompensa": {
          "PK": 20
        },
        "dialogo": {
          "recepcionista": "Ingreso en Cardiovascular + Metabólico. Paciente listo para valoración. Resumen: ¡Boom! Primer caso del turno. Deportista de 25 años. Llega tras una competición. Está ansioso, con taquicardia (110 lpm), y en su analítica destaca una glucosa en sangre de 250 mg/dL (hiperglucemia) a pesar de no ser diabético. Su sudoración es profusa.",
          "doctora": "¿Qué dos receptores están trabajando horas extras para causar este combo de síntomas?"
        }
      },
      "8": {
        "sistema": "Urinario + Cardiovascular (Interacción farmacológica)",
        "preguntas": {
          "introduccion": "¡Vaya lío! Paciente de 70 años con hipertensión e hiperplasia prostática. Toma un fármaco bloqueante α1 para ambos problemas. Hoy viene porque se siente mareado. Al medirle la presión, está 90/60 mmHg (hipotensión). Su frecuencia cardíaca es normal. ¿Por qué el mismo fármaco que le ayuda, ahora le perjudica?",
          "1": "El bloqueo de α1 vasculares causa vasodilatación e hipotensión",
          "2": "El fármaco activa los receptores β2 en su lugar",
          "3": "El bloqueo de α1 prostáticos afecta secundariamente al corazón",
          "4": "Es un efecto anticolinérgico que deshidrata al paciente",
          "correcta": 1
        },
        "sintomas": [
          "💫 Hipotensión (90/60 mmHg)",
          "😵 Mareo",
          "💊 Toma un bloqueante α1 (ej: Doxazosina)"
        ],
        "retroalimentacion": {
          "acierto": "¡Exacto! Es un efecto secundario clásico. El mismo mecanismo que relaja la próstata (α1), relaja los vasos (α1) y la presión se cae. La dosis debe reajustarse. ¡Gran manejo de efectos adversos!",
          "fallo": "Revisemos. Los bloqueantes α1 no activan β2 ni son anticolinérgicos. Su efecto primario es bloquear los receptores α1 en TODO el cuerpo, incluyendo los vasos, causando hipotensión. La respuesta es A."
        },
        "recompensa": {
          "PK": 20,
          "powerup": "Se recarga 1 uso de Farmacología Express"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Urinario + Cardiovascular (Interacción farmacológica). Paciente listo para valoración. Resumen: ¡Vaya lío! Paciente de 70 años con hipertensión e hiperplasia prostática. Toma un fármaco bloqueante α1 para ambos problemas. Hoy viene porque se siente mareado. Al medirle la presión, está 90/60 mmHg (hipotensión). Su frecuencia cardíaca es normal.",
          "doctora": "¿Por qué el mismo fármaco que le ayuda, ahora le perjudica?"
        }
      },
      "9": {
        "sistema": "Multisistémico (Jefe de nivel)",
        "preguntas": {
          "introduccion": "¡Alerta de código rojo! Paciente en la UCI con shock séptico. Tiene hipotensión severa (70/40 mmHg) que no responde a fluidos. También presenta piel fría y pálida y anuria (no produce orina). Para salvarle la vida, necesitamos usar un fármaco vasoactivo. ¿Qué receptor debemos activar de forma prioritaria para aumentar su presión arterial y perfundir sus órganos vitales?",
          "1": "Activación de receptores β2 en vasos musculares",
          "2": "Activación de receptores α1 en vasos sanguíneos",
          "3": "Activación de receptores M3 en el endotelio",
          "4": "Activación de receptores β1 en el corazón",
          "correcta": 2
        },
        "sintomas": [
          "⚠️ Hipotensión severa (70/40 mmHg)",
          "🥶 Piel fría y pálida",
          "🚫 Anuria",
          "🦠 Shock séptico"
        ],
        "retroalimentacion": {
          "acierto": "¡SÍ! α1 es la clave. Necesitamos vasoconstricción pura y dura para contraer esos vasos dilatados y subir la presión. La noradrenalina es nuestra mejor amiga aquí. Decisión correcta bajo presión extrema.",
          "fallo": "En una emergencia así, necesitamos actuar sobre los vasos. Activar β2 los dilataría más, empeorando todo. β1 aumentaría el corazón pero no resolvería la vasodilatación. La respuesta correcta era B, activar α1 para vasoconstricción."
        },
        "recompensa": {
          "PK": 30,
          "logro": "Maestro de las Catecolaminas",
          "powerup_permanente": "Visión de Jefe"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Multisistémico (Jefe de nivel). Paciente listo para valoración. Resumen: ¡Alerta de código rojo! Paciente en la UCI con shock séptico. Tiene hipotensión severa (70/40 mmHg) que no responde a fluidos. También presenta piel fría y pálida y anuria (no produce orina).",
          "doctora": "¿Qué receptor debemos activar de forma prioritaria para aumentar su presión arterial y perfundir sus órganos vitales?"
        }
      }
    },
    "resumen": {
      "PK_total_nivel": 70,
      "powerups": [
        "Farmacología Express (2)",
        "Rayos X del SNA",
        "Tutor Virtual (1)",
        "Visión de Jefe"
      ],
      "logros": "4/50",
      "proximo_nivel": "Nivel 4 (Experto)"
    }
  },
  "nivel_4": {
    "contexto": "La recepción y la Dra. Jessica presentarán efectos paradójicos, reacciones idiosincrásicas y diagnósticos complejos.",
    "casos": {
      "10": {
        "sistema": "Paradoja cardiovascular",
        "preguntas": {
          "introduccion": "Paciente con glaucoma en tratamiento con gotas de Timolol (un bloqueante β no selectivo). Sin embargo, hoy se queja de que su frecuencia cardíaca en reposo ha bajado a 50 lpm (bradicardia marcada), pero también dice sentirse mareado al levantarse. ¿Cómo explica que un bloqueante β, que debería principalmente afectar al corazón, le esté causando también hipotensión ortostática?",
          "1": "El Timolol bloquea receptores M2 además de los β",
          "2": "El bloqueo de los receptores β2 vasculares impide la vasodilatación compensatoria necesaria al ponerse de pie",
          "3": "El paciente tiene una sensibilidad idiosincrásica a todos los bloqueantes",
          "4": "El Timolol activa secundariamente receptores α2, causando hipotensión",
          "correcta": 2
        },
        "sintomas": [
          "💓 Bradicardia (50 lpm) - Efecto cardíaco esperado del β-bloqueo",
          "💫 Mareo ortostático (Hipotensión)"
        ],
        "retroalimentacion": {
          "acierto": "¡Lo lograste! Es un efecto sutil pero real. No todo es β1 en el corazón. Bloquear β2 vasculares puede romper el equilibrio fino de la presión arterial. Pensamiento de alto nivel.",
          "fallo": "Trampa difícil. Los β-bloqueadores no afectan receptores muscarínicos o α2 de forma primaria. La clave es que 'no selectivo' significa que también bloquea β2 y eso puede tener consecuencias vasculares inesperadas. La respuesta era B."
        },
        "recompensa": {
          "PK": 25
        },
        "dialogo": {
          "recepcionista": "Ingreso en Paradoja cardiovascular. Paciente listo para valoración. Resumen: Paciente con glaucoma en tratamiento con gotas de Timolol (un bloqueante β no selectivo). Sin embargo, hoy se queja de que su frecuencia cardíaca en reposo ha bajado a 50 lpm (bradicardia marcada), pero también dice sentirse mareado al levantarse.",
          "doctora": "¿Cómo explica que un bloqueante β, que debería principalmente afectar al corazón, le esté causando también hipotensión ortostática?"
        }
      },
      "11": {
        "sistema": "El fármaco camaleón",
        "preguntas": {
          "introduccion": "Un fármaco muy usado, la Clonidina, es un agonista α2. Se prescribe para la hipertensión. Sin embargo, en una sobredosis masiva, puede causar hipertensión severa transitoria antes de colapsar la presión. ¿Cómo se explica esta paradoja?",
          "1": "La Clonidina se convierte en un antagonista α1 a dosis altas",
          "2": "A dosis muy altas, estimula los receptores α2 presinápticos y también los postsinápticos α1, causando vasoconstricción",
          "3": "La sobredosis agota las catecolaminas, causando rebote",
          "4": "La Clonidina tiene metabolitos que son agonistas β1",
          "correcta": 2
        },
        "sintomas": [
          "💊 Sobredosis de Clonidina (agonista α2)",
          "📈 Hipertensión severa transitoria"
        ],
        "retroalimentacion": {
          "acierto": "¡Increíble! Captaste la nuance de la dosis y la pérdida de selectividad. De agonista α2 central a agonista α1 periférico. Este nivel de detalle marca la diferencia.",
          "fallo": "Es un concepto avanzado. A dosis normales, la Clonidina baja la presión. A dosis tóxicas, pierde selectividad y activa α1, constriñendo los vasos. La respuesta era B."
        },
        "recompensa": {
          "PK": 25,
          "powerup": "El Camaleón (1 uso)"
        },
        "dialogo": {
          "recepcionista": "Ingreso en El fármaco camaleón. Paciente listo para valoración. Resumen: Un fármaco muy usado, la Clonidina, es un agonista α2. Se prescribe para la hipertensión. Sin embargo, en una sobredosis masiva, puede causar hipertensión severa transitoria antes de colapsar la presión.",
          "doctora": "¿Cómo se explica esta paradoja?"
        }
      },
      "12": {
        "sistema": "Jefe final: efecto rebote",
        "preguntas": {
          "introduccion": "Último caso. Paciente joven tratado con un bloqueante α1 muy selectivo para una condición urológica. Decide suspender su medicación de golpe. A las 48 horas, llega a urgencias con taquicardia severa, dolor de cabeza pulsátil y una crisis hipertensiva. ¿Qué fenómeno está ocurriendo?",
          "1": "Una infección viral coincidente que afecta el SNA",
          "2": "Supersensibilidad por up-regulation de receptores α1 adrenérgicos",
          "3": "Activación masiva de receptores β2 por falta de antagonismo",
          "4": "El fármaco tenía un metabolito agonista β1 que ahora predomina",
          "correcta": 2
        },
        "sintomas": [
          "💊 Suspensión brusca de bloqueante α1",
          "💓 Taquicardia severa",
          "🤕 Cefalea pulsátil",
          "📈 Crisis hipertensiva (Rebote)"
        ],
        "retroalimentacion": {
          "acierto": "¡FENOMENAL! Diagnóstico exacto: up-regulation de receptores α1. Entiendes la farmacología a un nivel profundo. La suspensión brusca de muchos bloqueantes (α, β) puede causar este efecto rebote peligroso.",
          "fallo": "Este es el jefe final por una razón. No es una infección ni un metabolito. Es un principio: bloqueo crónico → up-regulation → rebote al suspender. La respuesta correcta era B."
        },
        "recompensa": {
          "PK": 40,
          "logro": "Lord/Lady de los Receptores",
          "titulo": "Residente Jefe de Neurofarmacología",
          "powerup_permanente": "Intuición de la Dra. Jessica"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Jefe final: efecto rebote. Paciente listo para valoración. Resumen: Último caso. Paciente joven tratado con un bloqueante α1 muy selectivo para una condición urológica. Decide suspender su medicación de golpe. A las 48 horas, llega a urgencias con taquicardia severa, dolor de cabeza pulsátil y una crisis hipertensiva.",
          "doctora": "¿Qué fenómeno está ocurriendo?"
        }
      }
    },
    "resumen": {
      "PK_total_nivel": 90,
      "powerups": [
        "Farmacología Express (2)",
        "Rayos X del SNA",
        "Tutor Virtual (1)",
        "Visión de Jefe",
        "El Camaleón (1)",
        "Intuición de la Dra. Jessica"
      ],
      "logros": "5/50",
      "proximo_nivel": "Nivel 5 (Leyenda)"
    }
  },
  "nivel_5": {
    "contexto": "Llegaste al pináculo del entrenamiento: síndromes raros, interacciones inusuales y presentaciones atípicas.",
    "casos": {
      "13": {
        "titulo": "La parálisis que no era",
        "preguntas": {
          "introduccion": "Paciente de 45 años, miasténico conocido, llega a urgencias con ptosis palpebral, dificultad para tragar y debilidad muscular generalizada que no responde a su medicación habitual. Sin embargo, al examinarlo con detenimiento, notas que sus pupilas están midriáticas y tiene taquicardia. ¿Qué error catastrófico podría estar ocurriendo?",
          "1": "Un raro virus que ataca solo los receptores nicotínicos",
          "2": "Sobredosis de medicación anticolinesterasa (ej: Neostigmina), causando un bloqueo por despolarización y crisis colinérgica",
          "3": "Un feocromocitoma concurrente que enmascara los síntomas",
          "4": "Una reactivación inusual del virus de la polio",
          "correcta": 2
        },
        "sintomas": [
          "⬇️ Ptosis, disfagia, debilidad",
          "👁️ Midriasis (paradoja)",
          "💓 Taquicardia (paradoja)"
        ],
        "retroalimentacion": {
          "acierto": "¡LO LOGRASTE! Diste en el clavo. Es la temida crisis colinérgica por sobredosis de piridostigmina. Parece una crisis miasténica pero las pupilas y el corazón delatan la sobrestimulación muscarínica inicial.",
          "fallo": "Casi. Un feocromocitoma no causa ptosis. La paradoja de debilidad con signos de activación simpática apunta a intoxicación por su tratamiento. La respuesta era B."
        },
        "recompensa": {
          "PK": 35
        },
        "dialogo": {
          "recepcionista": "Ingreso en La parálisis que no era. Paciente listo para valoración. Resumen: Paciente de 45 años, miasténico conocido, llega a urgencias con ptosis palpebral, dificultad para tragar y debilidad muscular generalizada que no responde a su medicación habitual. Sin embargo, al examinarlo con detenimiento, notas que sus pupilas están midriáticas y tiene taquicardia.",
          "doctora": "¿Qué error catastrófico podría estar ocurriendo?"
        }
      },
      "14": {
        "titulo": "El síndrome del fármaco vuelto loco",
        "preguntas": {
          "introduccion": "Hombre de 38 años, VIH+, en tratamiento con Ritonavir (inhibidor de la proteasa), ingresa por hipotensión severa y bradicardia sintomáticas que no responden a fluidos. Su medicación crónica incluye un betabloqueante para una miocardiopatía. Los niveles plasmáticos del betabloqueante están por las nubes. ¿Cuál es el mecanismo de esta interacción farmacológica letal?",
          "1": "El Ritonavir es un agonista β-adrenérgico inverso",
          "2": "El Ritonavir es un potente inhibidor del citocromo P450, elevando dramáticamente los niveles del betabloqueante",
          "3": "El Ritonavir causa insuficiencia renal aguda, reduciendo la excreción del betabloqueante",
          "4": "El Ritonavir se une a los receptores β1, potenciando el efecto del betabloqueante",
          "correcta": 2
        },
        "sintomas": [
          "💉 Tratamiento con Ritonavir y betabloqueante",
          "⬇️ Hipotensión severa + Bradicardia",
          "🧪 Niveles del betabloqueante extremadamente altos"
        ],
        "retroalimentacion": {
          "acierto": "¡Increíble! Conoces tus interacciones farmacológicas. El Ritonavir inhibe el CYP450, transformando una dosis normal de betabloqueante en una sobredosis masiva.",
          "fallo": "Interacción clásica del VIH: no es efecto directo sobre el receptor ni riñón. La clave es el hígado y el CYP450. La respuesta era B."
        },
        "recompensa": {
          "PK": 35,
          "powerup": {
            "nombre": "Chequeo Enzimático",
            "usos": 2,
            "descripcion": "Revela el perfil de metabolización hepática de un fármaco implicado en el caso."
          }
        },
        "dialogo": {
          "recepcionista": "Ingreso en El síndrome del fármaco vuelto loco. Paciente listo para valoración. Resumen: Hombre de 38 años, VIH+, en tratamiento con Ritonavir (inhibidor de la proteasa), ingresa por hipotensión severa y bradicardia sintomáticas que no responden a fluidos. Su medicación crónica incluye un betabloqueante para una miocardiopatía. Los niveles plasmáticos del betabloqueante están por las nubes.",
          "doctora": "¿Cuál es el mecanismo de esta interacción farmacológica letal?"
        }
      },
      "15": {
        "titulo": "Jefe final absoluto: el fantasma simpático",
        "preguntas": {
          "introduccion": "Paciente con tetraplejia completa por trauma cervical alto (C4). A pesar de su lesión, es traído de urgencia por hipertensión severa (220/130 mmHg), cefalea explosiva, rubor y diaforesis por encima del nivel de la lesión, y bradicardia. ¿Qué fenómeno mortal está ocurriendo y por qué es una urgencia extrema?",
          "1": "Un accidente cerebrovascular hemorrágico concurrente",
          "2": "Disreflexia Autónoma. Un estímulo nocivo por debajo de la lesión (ej: vejiga llena) desencadena una descarga simpática masiva no modulada por el SNC",
          "3": "Una infección sistémica que ha sobrepasado la barrera hematoencefálica",
          "4": "Mala perfusión medular que causa isquemia y liberación de catecolaminas",
          "correcta": 2
        },
        "sintomas": [
          "🪓 Lesión cervical alta (C4) - Desconexión del control simpático central",
          "📈 Hipertensión severa (220/130)",
          "🧠 Cefalea explosiva",
          "🍅 Rubor y sudoración por encima de la lesión",
          "💓 Bradicardia (paradoja)"
        ],
        "retroalimentacion": {
          "acierto": "¡NO LO PUEDO CREER! Disreflexia Autónoma. Has diagnosticado una de las urgencias más temidas. El primer movimiento es eliminar el estímulo (p. ej., sonda urinaria obstruida) para evitar ACV o edema pulmonar. Eres una Leyenda Viva.",
          "fallo": "La clave es la desconexión: la lesión cervical alta desconecta el cerebro de la médula espinal. Un estímulo por debajo desencadena una tormenta simpática que el cerebro no puede apagar. La respuesta era B."
        },
        "recompensa": {
          "PK": 50,
          "logro": "La Leyenda del SNA",
          "titulo": "Jefe de Servicio de Neurociencias",
          "recompensa_final": "Puesto en el equipo de investigación de neurofarmacología de élite de la Dra. Jessica"
        },
        "dialogo": {
          "recepcionista": "Ingreso en Jefe final absoluto: el fantasma simpático. Paciente listo para valoración. Resumen: Paciente con tetraplejia completa por trauma cervical alto (C4). A pesar de su lesión, es traído de urgencia por hipertensión severa (220/130 mmHg), cefalea explosiva, rubor y diaforesis por encima del nivel de la lesión, y bradicardia.",
          "doctora": "¿Qué fenómeno mortal está ocurriendo y por qué es una urgencia extrema?"
        }
      }
    },
    "resumen": {
      "PK_total_nivel": 120,
      "PK_totales": 370,
      "logros": "8/50",
      "estado": "Leyenda"
    }
  },
  "modo_escape_room_leg": {
    "estado": "Disponible",
    "descripcion": "¿Te atreves con el MODO ESCAPE ROOM en dificultad LEGENDARIA?"
  }
}